In [1]:
# Broadcasting describes how arthematic works b/t arrays of different shapes.
arr = range(5)
arr = (1, 2, 3, 4, 5)
arr = 4
print (arr)

4

In [2]:
#  array (4,3) vector (3,)
#  1D = vector
# vector = (3,) = 1D,
#  In case of +, - of tqo arrays where 1 = (4,3) 2nd = (3,), since both are of different shapes, the one with less values will 
# be multiplied with other. (4,3)=> 4 = rows and 3 = column and the 2nd box = (3,) => only rows given and column are lesser than
# 1st. Hence, 3 {of second array} * 3 {column of first array}.

In [3]:
import numpy as np

In [4]:
x= np.array ([[1,2,3]])  #1 row, 3 column coz all numbers are within same [] (1,3) 1 row+ to make =  Vector2
print (x.shape)
y= np.array ([[4],[5]])  #2rows, 1 column coz 4 and 5 are in separate [], hence separated by rows. (2,1) 2c + to make= Vector1
print (y.shape)

(1, 3)
(2, 1)

In [5]:
x,y = np.broadcast_arrays(x,y)

In [6]:
x

array([[1, 2, 3],
       [1, 2, 3]])

In [7]:
#  when two vectors are not of same shape, they are added by bradcasting. Because for vectors it is necessary that the shape is 
# same of both.
#  for every row, it must be a vector. CONDITION

# PANDAS

Numpy deals with tensor in forms of matrix, vector etc.
Pandas can embrace strings as well i.e multi-datatype can exit here.
2 Data structures = "Series" and "DataFrame"
The arrangement of data one has= data structure.

In [8]:
import pandas as pd   #1 step done everytime.

# SERIES In PANDAS

In [9]:
#  a secquence of numbers = series.

In [10]:
s1 = pd.Series([11,22,33,44,55,66,77,88,99,10])
s1   #indexing provided with series.     s1= pandas Series object
#0 to 9 (output)= default index given by series object.

0    11
1    22
2    33
3    44
4    55
5    66
6    77
7    88
8    99
9    10
dtype: int64

In [11]:
# Can there be other indexing except default one?

In [12]:
s1[9]    #Value accessed by index.

10

In [13]:
s1[[2,3,4]]   #come out with multiple values by index. Not possible in numpy.

2    33
3    44
4    55
dtype: int64

In [14]:
s1[5]= 555  #replacing value on index 5

In [15]:
del s1[6]  #deletes value on given index.
s1         # deleting values is permanent.

0     11
1     22
2     33
3     44
4     55
5    555
7     88
8     99
9     10
dtype: int64

In [16]:
s1[5]= 55555
s1[[2,3,4,5]]= [222,333,444,555]   #modifying values in a Series.

In [17]:
s1   #values modified.

0     11
1     22
2    222
3    333
4    444
5    555
7     88
8     99
9     10
dtype: int64

In [18]:
s1[99]= 999  #pass some new index  ====> INSERTING , if index exists, value would be replaced. Hence, provide sone new index.
s1

0      11
1      22
2     222
3     333
4     444
5     555
7      88
8      99
9      10
99    999
dtype: int64

In [19]:
s1[22]= 222
s1[88]= 888  #multiple inserting.
s1

0      11
1      22
2     222
3     333
4     444
5     555
7      88
8      99
9      10
99    999
22    222
88    888
dtype: int64

In [20]:
#  position doesn't matter here cos this is series, hence a value to be + in mid doesn't really matter.
#  position indexing viz- not a big deal here.

In [21]:
s2 = pd.Series([10,20,30,40], index= ['orange','apples','bananas', 'kiwi'])

In [22]:
s2

orange     10
apples     20
bananas    30
kiwi       40
dtype: int64

In [23]:
s2.index                #.index

Index(['orange', 'apples', 'bananas', 'kiwi'], dtype='object')

In [24]:
s2.values               #.values

array([10, 20, 30, 40], dtype=int64)

In [25]:
s2<30     #for values havoing index <30

orange      True
apples      True
bananas    False
kiwi       False
dtype: bool

In [26]:
s2[s2>30]

kiwi    40
dtype: int64

In [27]:
'peach' in s2   #checking if given key is present in Series.

False

In [28]:
'bananas' in s2

True

In [29]:
#  Index itself is a key.

# Creating a Series by using Dictionary

In [30]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah':5000}
data = pd.Series(sdata)
data
# dictionary was never in this form. NOw it's made a Series, i.e data = rows and columns.

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [31]:
states = ['Caloifornia', 'Ohio', 'Oregon', 'Texas']
data1= pd.Series(sdata,  index=states)
data1
# NaN = Not a Number.

#  pd.Series(sdata,  index=states) ==> index to be of states but keys to be from sdata.

Caloifornia        NaN
Ohio           35000.0
Oregon         16000.0
Texas          71000.0
dtype: float64

In [32]:
data1.isnull()     
# When  practically dealing with data, it will be of 1000s of rows, so in order to check if any value if NaN, use this .isnull()

Caloifornia     True
Ohio           False
Oregon         False
Texas          False
dtype: bool

In [33]:
data1.notnull()

Caloifornia    False
Ohio            True
Oregon          True
Texas           True
dtype: bool

# Data Frame

In [34]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year' : [2000,2001,2002,2003,2004,2005],
         'pop' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]                }
df1 = pd.DataFrame(data)
df1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2003  2.4
4  Nevada  2004  2.9
5  Nevada  2005  3.2

In [35]:
data1= {'Friends': ['Hiba', 'Neha', 'Hiba', 'Sukaina', 'Amber' ],
        'Age'    : [19, 19, 19, 20, 20],
        'Bond'   : [ 'Strongest','Good', 'Good', 'Good', 'Good']               }
dframe = pd.DataFrame(data1)
dframe

   Friends  Age       Bond
0     Hiba   19  Strongest
1     Neha   19       Good
2     Hiba   19       Good
3  Sukaina   20       Good
4    Amber   20       Good

In [36]:

type(dframe)

pandas.core.frame.DataFrame

In [37]:
dframe.shape

(5, 3)

In [38]:
df1['pop']    #selecting single columns by column header

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [39]:
df1[['pop','state']]    #selecting multiple columns by column header

   pop   state
0  1.5    Ohio
1  1.7    Ohio
2  3.6    Ohio
3  2.4  Nevada
4  2.9  Nevada
5  3.2  Nevada

In [40]:
df1 [['pop','year']]

   pop  year
0  1.5  2000
1  1.7  2001
2  3.6  2002
3  2.4  2003
4  2.9  2004
5  3.2  2005

In [41]:
dframe[['Friends', 'Age']]

   Friends  Age
0     Hiba   19
1     Neha   19
2     Hiba   19
3  Sukaina   20
4    Amber   20

In [42]:
dframe[['Friends']]       #Column selection.

   Friends
0     Hiba
1     Neha
2     Hiba
3  Sukaina
4    Amber

In [43]:
del df1['pop']            #deleting column
df1

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2003
4  Nevada  2004
5  Nevada  2005

In [44]:
df1['debt']= 1000         #inserting column by single value

In [45]:
df1

    state  year  debt
0    Ohio  2000  1000
1    Ohio  2001  1000
2    Ohio  2002  1000
3  Nevada  2003  1000
4  Nevada  2004  1000
5  Nevada  2005  1000

In [46]:
df1['debt']= [1000,200,300,400,500,600]       #Inserting column with several values.

In [47]:
df1

    state  year  debt
0    Ohio  2000  1000
1    Ohio  2001   200
2    Ohio  2002   300
3  Nevada  2003   400
4  Nevada  2004   500
5  Nevada  2005   600

In [48]:
df1['debt']= range(6)         #Inserting column by providing range.

In [49]:
df1

    state  year  debt
0    Ohio  2000     0
1    Ohio  2001     1
2    Ohio  2002     2
3  Nevada  2003     3
4  Nevada  2004     4
5  Nevada  2005     5

In [50]:
dframe['Height']= ['Small', 'Tall','Tall', 'Avg', 'Small']

In [51]:
dframe

   Friends  Age       Bond Height
0     Hiba   19  Strongest  Small
1     Neha   19       Good   Tall
2     Hiba   19       Good   Tall
3  Sukaina   20       Good    Avg
4    Amber   20       Good  Small

In [52]:
import pandas as pd
data2 = {'AI EO': [90,85,80,75,70,65,60],       #Index provided.
         'Python1'  : [45,50,55,60,65,70,75],
         'Python2'  : [50,55,60,65,70,75,80]                   }
data2= pd.DataFrame(data2, index=(['Roman',"Bushra",'Ajwa','Rubab','Tehzeeb','Hifza','Sumaira']))

In [53]:
data2['AI EO']

Roman      90
Bushra     85
Ajwa       80
Rubab      75
Tehzeeb    70
Hifza      65
Sumaira    60
Name: AI EO, dtype: int64

In [54]:
data2['Total']=[185, 190, 195, 200, 205, 210, 205]

In [65]:
data2['Status']=['Fail' if totalNum<200 else 'Pass' for totalNum in data2['Total']]
data2                                                #list comprehension done.

         AI EO  Python1  Python2  Total Status
Roman       90       45       50    185   Fail
Bushra      85       50       55    190   Fail
Ajwa        80       55       60    195   Fail
Rubab       75       60       65    200   Pass
Tehzeeb     70       65       70    205   Pass
Hifza       65       70       75    210   Pass
Sumaira     60       75       80    215   Pass

In [56]:
data2[data2[Total>200]]=['Pass']
data2[Total<200]= ["Fail"]                           #fuckkkkkkk

NameError: name 'Total' is not defined

In [61]:
data2['Total']= data2['AI EO']+ data2['Python1']+ data2['Python2']

In [62]:
data2['Status']= ['Pass'if marks>=200 else 'fail' for marks in data2.Total]   #list comprehension, instead of fuckkkkk
data2

         AI EO  Python1  Python2  Total Status
Roman       90       45       50    185   fail
Bushra      85       50       55    190   fail
Ajwa        80       55       60    195   fail
Rubab       75       60       65    200   Pass
Tehzeeb     70       65       70    205   Pass
Hifza       65       70       75    210   Pass
Sumaira     60       75       80    215   Pass

In [63]:
data2

         AI EO  Python1  Python2  Total Status
Roman       90       45       50    185   fail
Bushra      85       50       55    190   fail
Ajwa        80       55       60    195   fail
Rubab       75       60       65    200   Pass
Tehzeeb     70       65       70    205   Pass
Hifza       65       70       75    210   Pass
Sumaira     60       75       80    215   Pass

In [60]:
data2

         AI EO  Python1  Python2  Total Status
Roman       90       45       50    185   Pass
Bushra      85       50       55    190   Pass
Ajwa        80       55       60    195   Pass
Rubab       75       60       65    200   Pass
Tehzeeb     70       65       70    205   Pass
Hifza       65       70       75    210   Pass
Sumaira     60       75       80    205   Pass

In [59]:
data2['Status']= ['Pass'if a>=33 and p1>=33 and p2>=33 else 'fail' for a,p1,p2 in zip(data2["AI EO"], data2['Python1'], data2["Python2"])]
data2

         AI EO  Python1  Python2  Total Status
Roman       90       45       50    185   Pass
Bushra      85       50       55    190   Pass
Ajwa        80       55       60    195   Pass
Rubab       75       60       65    200   Pass
Tehzeeb     70       65       70    205   Pass
Hifza       65       70       75    210   Pass
Sumaira     60       75       80    205   Pass

In [57]:
#  zip used in order to get all values of AI EO, Python1, Python2 in one form>>>>>> tupple.










# list comprehension done above.

In [80]:
data2['Status']=np.where((((data2["AI EO"]<50) & (data2['Python1']<50) & data2["Python2"]<50)),'Fail', 'Pass') 
data2

         AI EO  Python1  Python2  Total Status
Roman       90       45       50    185   Fail
Bushra      85       50       55    190   Fail
Ajwa        80       55       60    195   Fail
Rubab       75       60       65    200   Fail
Tehzeeb     70       65       70    205   Fail
Hifza       65       70       75    210   Fail
Sumaira     60       75       80    215   Fail

In [ ]:
#         >>>  np.where  <<<
# condition given in np.where()


# implementation of pass and fail donbe through function > no.where<

In [66]:
data2["AI EO"]

Roman      90
Bushra     85
Ajwa       80
Rubab      75
Tehzeeb    70
Hifza      65
Sumaira    60
Name: AI EO, dtype: int64

In [67]:
data2.loc["Tehzeeb"]       #by index, info got ==> loc function used.     indexing

AI EO        70
Python1      65
Python2      70
Total       205
Status     Pass
Name: Tehzeeb, dtype: object

In [68]:
data2.loc['Tehzeeb':'Sumaira']                                                      #slicing

         AI EO  Python1  Python2  Total Status
Tehzeeb     70       65       70    205   Pass
Hifza       65       70       75    210   Pass
Sumaira     60       75       80    215   Pass

In [69]:
data2.iloc[1:3]              #iloc excludes first value                                   slicing

        AI EO  Python1  Python2  Total Status
Bushra     85       50       55    190   Fail
Ajwa       80       55       60    195   Fail

In [70]:
a= for a in range(6):
    print(a)

SyntaxError: invalid syntax (<ipython-input-70-0ee40bc18642>, line 1)

In [71]:
c = zip(a,b)
for i in c:
    print(i)

NameError: name 'a' is not defined

In [72]:
per= Total/300*100

data2['Percentage']=data2['Roman', per]

NameError: name 'Total' is not defined

In [73]:
numbers= [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]
evenArr = []
oddArr = []
for num in numbers:
    if num%2==0:
        evenArr.append(num)
    else:
        oddArr.append(num)
print("Evens>>> ", evenArr)
print("Odds>>> ", oddArr)

Evens>>>  [2, 4, 6, 8, 10, 12, 14]
Odds>>>  [1, 3, 5, 7, 9, 11, 13, 15]

In [74]:
# Everything's done within the boundary of lists >> List comprehension.
[]

[]

In [75]:
#  for loop accesses single value, when 2 or more value to be taken at a time ==> zip looop will be in for of a packet.